# Statistics

In [1]:
import pandas as pd 
df = pd.read_excel(r"C:\Users\Bande Nityananda\OneDrive\Documents\6th SEM Internship  ML\Data sets\weather_data_XL (1).xlsx")
df

        Date        City  Temperature_C  Humidity_% Condition
0 2025-01-01    Hyderbad             28          60     Sunny
1 2025-01-02    Hyderbad             29          62     Sunny
2 2025-01-03    Hyderbad             30          58    Cloudy
3 2025-01-04    Hyderbad             31          55    Cloudy
4 2025-01-05    Banglore             32          57     Rainy
5 2025-01-06    Banglore             33          59     Rainy
6 2025-01-07    Banglore             34          61     Sunny
7 2025-01-08    Banglore             32          63    Cloudy
8 2025-01-09  Vijayawada             31          64     Rainy
9 2025-01-10  Vijayawada             29          62     Sunny

In [2]:
df['Temperature_C'].max()

np.int64(34)

In [3]:
df['Temperature_C'].min()

np.int64(28)

In [4]:
df['Temperature_C'].mean()

np.float64(30.9)

In [5]:
df['Temperature_C'].describe()

count    10.000000
mean     30.900000
std       1.911951
min      28.000000
25%      29.250000
50%      31.000000
75%      32.000000
max      34.000000
Name: Temperature_C, dtype: float64

In [6]:
df['Temperature_C'].std()

np.float64(1.911950719959998)

In [8]:
df['Temperature_C'].var()

np.float64(3.6555555555555554)

In [9]:
df[df.Temperature_C == df.Temperature_C.max()]

        Date      City  Temperature_C  Humidity_% Condition
6 2025-01-07  Banglore             34          61     Sunny

In [10]:
df.City[df.Temperature_C == df.Temperature_C.max()]

6    Banglore
Name: City, dtype: object

In [11]:
df.count()

Date             10
City             10
Temperature_C    10
Humidity_%       10
Condition        10
dtype: int64

In [12]:
df["City"].nunique()

3

In [13]:
df["City"].value_counts()

City
Hyderbad      4
Banglore      4
Vijayawada    2
Name: count, dtype: int64

# String Cleaning

In [14]:
df

        Date        City  Temperature_C  Humidity_% Condition
0 2025-01-01    Hyderbad             28          60     Sunny
1 2025-01-02    Hyderbad             29          62     Sunny
2 2025-01-03    Hyderbad             30          58    Cloudy
3 2025-01-04    Hyderbad             31          55    Cloudy
4 2025-01-05    Banglore             32          57     Rainy
5 2025-01-06    Banglore             33          59     Rainy
6 2025-01-07    Banglore             34          61     Sunny
7 2025-01-08    Banglore             32          63    Cloudy
8 2025-01-09  Vijayawada             31          64     Rainy
9 2025-01-10  Vijayawada             29          62     Sunny

In [15]:
df["City"] = df["City"].str.lower()
df

        Date        City  Temperature_C  Humidity_% Condition
0 2025-01-01    hyderbad             28          60     Sunny
1 2025-01-02    hyderbad             29          62     Sunny
2 2025-01-03    hyderbad             30          58    Cloudy
3 2025-01-04    hyderbad             31          55    Cloudy
4 2025-01-05    banglore             32          57     Rainy
5 2025-01-06    banglore             33          59     Rainy
6 2025-01-07    banglore             34          61     Sunny
7 2025-01-08    banglore             32          63    Cloudy
8 2025-01-09  vijayawada             31          64     Rainy
9 2025-01-10  vijayawada             29          62     Sunny

In [16]:
df["City"] = df["City"].str.upper()
df

        Date        City  Temperature_C  Humidity_% Condition
0 2025-01-01    HYDERBAD             28          60     Sunny
1 2025-01-02    HYDERBAD             29          62     Sunny
2 2025-01-03    HYDERBAD             30          58    Cloudy
3 2025-01-04    HYDERBAD             31          55    Cloudy
4 2025-01-05    BANGLORE             32          57     Rainy
5 2025-01-06    BANGLORE             33          59     Rainy
6 2025-01-07    BANGLORE             34          61     Sunny
7 2025-01-08    BANGLORE             32          63    Cloudy
8 2025-01-09  VIJAYAWADA             31          64     Rainy
9 2025-01-10  VIJAYAWADA             29          62     Sunny

In [17]:
df["City"] = df["City"].str.replace("HYDERBAD","CHENNAI")
df

        Date        City  Temperature_C  Humidity_% Condition
0 2025-01-01     CHENNAI             28          60     Sunny
1 2025-01-02     CHENNAI             29          62     Sunny
2 2025-01-03     CHENNAI             30          58    Cloudy
3 2025-01-04     CHENNAI             31          55    Cloudy
4 2025-01-05    BANGLORE             32          57     Rainy
5 2025-01-06    BANGLORE             33          59     Rainy
6 2025-01-07    BANGLORE             34          61     Sunny
7 2025-01-08    BANGLORE             32          63    Cloudy
8 2025-01-09  VIJAYAWADA             31          64     Rainy
9 2025-01-10  VIJAYAWADA             29          62     Sunny

# Concate Data Frames

In [18]:
india_weather = pd.DataFrame({
    "city" : ["mumbai","banglore","Hyderabad"],
    "Temperature": [32,45,35]
})
india_weather

        city  Temperature
0     mumbai           32
1   banglore           45
2  Hyderabad           35

In [19]:
US_weather = pd.DataFrame({
    "city" : ["New york","Chicago","orlando"],
    "Temperature": [32,45,35]
})
US_weather

       city  Temperature
0  New york           32
1   Chicago           45
2   orlando           35

In [20]:
df = pd.concat([india_weather,US_weather])
df

        city  Temperature
0     mumbai           32
1   banglore           45
2  Hyderabad           35
0   New york           32
1    Chicago           45
2    orlando           35

In [21]:
df = pd.concat([india_weather,US_weather],ignore_index=True)
df

        city  Temperature
0     mumbai           32
1   banglore           45
2  Hyderabad           35
3   New york           32
4    Chicago           45
5    orlando           35

In [22]:
df = pd.concat([india_weather,US_weather],axis=1)
df

        city  Temperature      city  Temperature
0     mumbai           32  New york           32
1   banglore           45   Chicago           45
2  Hyderabad           35   orlando           35

# Merge DataFrames

In [24]:
temp_df = pd.DataFrame({
    "city":["Hyderbad","Viaywada","Vishakapatnam","Bangalore"],
    "temperature":[32,45,30,35]
})
temp_df

            city  temperature
0       Hyderbad           32
1       Viaywada           45
2  Vishakapatnam           30
3      Bangalore           35

In [25]:
humidity_df = pd.DataFrame({
    "city":["Hyderbad","Viaywada","Vishakapatnam","chennai"],
    "humidity":[32,45,30,35]
})
humidity_df

            city  humidity
0       Hyderbad        32
1       Viaywada        45
2  Vishakapatnam        30
3        chennai        35

In [26]:
df = pd.merge(temp_df,humidity_df,on="city")
df

            city  temperature  humidity
0       Hyderbad           32        32
1       Viaywada           45        45
2  Vishakapatnam           30        30

In [27]:
df = pd.merge(temp_df,humidity_df,on="city",how="outer")
df

            city  temperature  humidity
0      Bangalore         35.0       NaN
1       Hyderbad         32.0      32.0
2       Viaywada         45.0      45.0
3  Vishakapatnam         30.0      30.0
4        chennai          NaN      35.0

In [28]:
df.isnull()

    city  temperature  humidity
0  False        False      True
1  False        False     False
2  False        False     False
3  False        False     False
4  False         True     False

In [29]:
df.isnull().sum()

city           0
temperature    1
humidity       1
dtype: int64

In [30]:
df['temperature']=df['temperature'].fillna(df.temperature.min())

In [31]:
df.isnull()

    city  temperature  humidity
0  False        False      True
1  False        False     False
2  False        False     False
3  False        False     False
4  False        False     False

In [32]:
df

            city  temperature  humidity
0      Bangalore         35.0       NaN
1       Hyderbad         32.0      32.0
2       Viaywada         45.0      45.0
3  Vishakapatnam         30.0      30.0
4        chennai         30.0      35.0